Documents/ЗапускБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗапускБП</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОперацииБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТССтартоватьСВыбраннойСтадии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаСтарта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСПуть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСМероприятие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПровестиВФоновомРежиме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НастройкиБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиБП</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОперацииБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗапускБП/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	//
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	Элементы.Схема.ТолькоПросмотр = (Объект.Операция = 
			ПредопределенноеЗначение("Справочник.ОперацииБП.Произвольная"));
			
	МассивДанных = Объект.Ссылка.ТочкаСтарта.Получить();
	Если МассивДанных <> Неопределено Тогда
		ТСИсполнитель = МассивДанных.ТСИсполнитель;
		ТСОбъектРодитель = МассивДанных.ТСОбъектРодитель;
		ТССхема = МассивДанных.ТССхема;
		ТСТипМероприятия = МассивДанных.ТСТипМероприятия;
		ТСТочка = МассивДанных.ТСТочка;
		ТСМассив.Загрузить(МассивДанных.ТСМассив);
	КонецЕсли;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
	Элементы.ОбъектыПодборПоНастройкам.Видимость = Константы.ИспользоватьНастройкиПодбораОбъектовУчета.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ОперацияПриИзменении(Элемент)
	Элементы.Схема.ТолькоПросмотр = (Объект.Операция = 
			ПредопределенноеЗначение("Справочник.ОперацииБП.Произвольная"));
			
	ЗаполнитьСхему();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСхему()
	Объект.Схема = РегистрыСведений.НастройкиБП.ПолучитьСхемуПоОперации(Объект.Организация, Объект.Подразделение, Объект.Операция);
КонецПроцедуры

&НаСервере
Процедура ПодборВтаблЧасть(Результат)
	Об = РеквизитФормыВЗначение("Объект");		
	РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Об.ДолговыеОбязательства, Результат);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтадию(Команда)
	#Если Вебклиент Тогда
		Сообщить("Данный функционал не доступен на Веб-клиенте!");
		Объект.ТССтартоватьСВыбраннойСтадии = Ложь;
	#Иначе
		
		Форма = ПолучитьФорму("Документ.ЗапускБП.Форма.ФормаТочкиСтарта",, ЭтотОбъект);
		Форма.ТекСхема = Объект.Схема;
		//Чуров
		//Если ОткрытьФорму(Форма) = Истина Тогда
		//Если Форма.ОткрытьМодально() = Истина Тогда
		//Форма.ОткрытьМодально();
		ОткрытьФорму(Форма);
		//Форма.Открыть();
		//ТСИсполнитель = Форма.ТСИсполнитель;
		//Объект.ТСМероприятие = Форма.ТСМероприятие;
		//ТСОбъектРодитель = Форма.ТСОбъектРодитель;
		//Объект.ТСПуть = Форма.ТСПуть;
		//ТССхема = Форма.ТССхема;
		//ТСТипМероприятия = Форма.ТСТипМероприятия;
		//ТСТочка = Форма.ТСТочка;
		//
		//ТСМассив.Очистить();
		//Для Каждого Элемент Из Форма.ТСМассив Цикл
		//	НоваяСтрока = ТСМассив.Добавить();
		//	НоваяСтрока.Идентификатор = Элемент.Идентификатор;
		//	НоваяСтрока.Схема = Элемент.Схема;
		//	НоваяСтрока.ОбъектРодитель = Элемент.ОбъектРодитель;
		//КонецЦикла;
		//КонецЕсли;
	#КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФормуДокументаИзФормыТочкиСтарта(ФормаТочкиСтарта)
	Форма = ФормаТочкиСтарта;
	ТСИсполнитель = Форма.ТСИсполнитель;
	Объект.ТСМероприятие = Форма.ТСМероприятие;
	ТСОбъектРодитель = Форма.ТСОбъектРодитель;
	Объект.ТСПуть = Форма.ТСПуть;
	ТССхема = Форма.ТССхема;
	ТСТипМероприятия = Форма.ТСТипМероприятия;
	ТСТочка = Форма.ТСТочка;
	ТСМассив.Очистить();
	Для Каждого Элемент Из Форма.ТСМассив Цикл
		НоваяСтрока = ТСМассив.Добавить();
		НоваяСтрока.Идентификатор = Элемент.Идентификатор;
		НоваяСтрока.Схема = Элемент.Схема;
		НоваяСтрока.ОбъектРодитель = Элемент.ОбъектРодитель;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПоместитьВХранилище(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилище(Отказ)
	МассивДанных = Новый Структура("ТСИсполнитель, ТСОбъектРодитель, ТССхема, ТСТипМероприятия, ТСТочка, ТСМассив", 
			ТСИсполнитель, ТСОбъектРодитель, ТССхема, ТСТипМероприятия, ТСТочка, ТСМассив.Выгрузить());
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПоместитьВХранилище(МассивДанных);
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элементы.ОбъектыОбъект.ВыбиратьТип = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.ОбъектыОбъект.ВыбиратьТип = (Элементы.Объекты.ТекущиеДанные.Объект = Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.ЗапускБП.Форма.ФормаТочкиСтарта" Тогда
		Если ВыбранноеЗначение <> Неопределено Тогда
			ЗаполнитьФормуДокументаИзФормыТочкиСтарта(ИсточникВыбора);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Источник)
	Если ИмяСобытия = "УдалитьДублиОбъектов" И Источник = "ФормаПодборДО" Тогда
		УдалитьДублиОбъектовПодбора();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьДублиОбъектовПодбора()
	ТЗ = Объект.Объекты.Выгрузить();
	ТЗ.Свернуть("Объект");
	Объект.Объекты.Загрузить(ТЗ);
КонецПроцедуры
